#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/myjobplanner/myjobplanner-dev/runs/run-cBKrtcPPv4JxNLxC

Waiting for the plan to start...

Terraform v1.0.6
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # auth0_resource_server.myjobplanner-api will be created
  + resource "auth0_resource_server" "myjobplanner-api" {
      + id                                              = (known after apply)
      + identifier                                      = "https://api.myjobplanner.com"
      + name                                            = "myjobplanner-api"
      + signing_alg                                     = "RS256"
      + signing_secret                                  = (known after apply)
      + skip_consent_for_verifiable_first_party_clients = true
      + token_lifetime                                  = 8600
      + token_lifetime_for_web                          = (known after apply)

      + scopes {
          + description = "Create business"
          + value       = "create:business"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @nsb, Action: `pull_request`*